#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
// & - 按（2进制）位与 如果两个操作数的当前位都是1则结果为1，否则为0
// | - 按（2进制）位或 如果两个操作数的当前位至少有一个是1则结果为1，否则为0
// ^ - 按（2进制）位异或 如果两个操作数的当前位相同时结果为0，不同时则为1

//int main()
//{
//	int a = 3;
//	int b = -5;
//	int c = a & b;
//
//	printf("c=%d\n", c);
//
//	return 0;
//}


//不能创建临时变量(第三个变量)，实现两个数的交换

//int main()
//{// 这种方法可能会有溢出的问题
//	int a = 3;
//	int b = 5;
//
//	printf("交换前：a=%d b=%d\n", a, b);
//	a = a + b;
//	b = a - b;
//	a = a - b;
//	printf("交换后：a=%d b=%d\n", a,b);
//
//	return 0;
//
//}



//3^3 = 0 -> a^a = 0
//0^5 = 5 -> 0^a = a 

//3^3^5=5  
//3^5^3=5
//异或支持交换律
//011
//011
//000
//110
//110
//
//011
//101
//110
//011
//101




//不能创建临时变量(第三个变量)，实现两个数的交换
//int main()
//{
//	int a = 3;
//	int b = 5;
//
//	printf("交换前：a=%d b=%d\n", a, b);
//
//	a = a ^ b;//a=3^5
//	b = a ^ b;//b=3^5^5=3
//	a = a ^ b;//3^5^
//	printf("交换后: a=%d b=%d\n", a, b);
//
//	return 0;
//}



//int main()
//{
//	int a = 3;
//	//	~ 是按二进制位取反
//	// 00000000000000000000000000000011 - 补码
//	// 11111111111111111111111111111100 -> ~a 
//	// 11111111111111111111111111111011 - -1取反得原码
//	// 10000000000000000000000000000100 - 原码
//	// -4
//
//	printf("a=%d", ~a);
//
//	return 0;
//}


//int main()
//{
//	int a = 13;
//	a |= (1 << 4);//a=29
//	printf("%d\n", a);
//	a &= (~(1 << 4));//a=13
//	printf("%d\n", a);
//
//	
//
//	return 0;
//}


// & 取地址
// * 间接访问操作符（解引用操作符）

//int main()
//{
//	int a = 10;
//	int* p = &a;
//	*p = 20;
//
//	printf("%d\n", a);
//
//	return 0;
//}


//强制类型转换
//int main()
//{
//	int a = (int)3.14;
//	printf("%d\n", a);
//
//
//	return 0;
//}


//单目操作符
// ! 逻辑反操作
// - 负值 + 正值
// & 取地址
// sizeof 操作数的类型长度(以字节为单位)
// ~ 对一个数进行二进制按位取反
// -- 前置、后置减减
// ++ 前置、后置加加
// * 间接访问操作符(解引用操作符)
// (类型) 强制类型转换

//int main()
//{
//	int a = 0;
//	printf("%d\n", sizeof(a));
//	printf("%d\n", sizeof(int));
//
//	//sizeof是操作符，不是函数
//	//strlen是库函数，是用来求字符串长度
//	printf("%d\n", sizeof a);//不用括号也可以 sizeof不是函数
//}

//int main()
//{
//	if (3 == 5)
//	{
//
//	}
//	if ("abc" == "abcdefg") //这样写是在比较2个字符串的首字母地址
//	{
//		//两个字符串比较相等应该使用strcmp
//	}
//	return 0;
//}


//逻辑操作符
//int main()
//{
//	int a = 3;
//	int b = 5;
//	int e = -1;
//	int c = a && b;//并且
//	int d = a || b;//或者
//	int f = a || e;//或者
//	printf("%d\n", c);
//	printf("%d\n", d);
//	printf("%d\n", f);
//
//	return 0;
//}


//判断闰年
//1.能被4整除，并且不能被100整除
//2.能被400整除是闰年

//int is_lep_year(int y)
//{
//	if (((y % 4 == 0) && (y % 100 != 0) || (y % 400 == 0) ))
//	{
//		return 1;
//	}
//	else
//	{
//		return 0;
//	}
//}
//
//int main()
//{
//	return 0;
//}


// && 左边为假，右边就不运算了
// || 左边为真，右边就不运算了
int main()
{
	int i = 0, a = 0, b = 2, c = 3, d = 4;

	i = a++ && ++b && d++;

	//i = a++ || ++b || d++;
	printf("a = %d\nb = %d\nc = %d\nd = %d\n", a, b, c, d);

	return 0;
}





